(package! conda)

(package! ein)

(package! ewal-doom-themes)
(package! doom-themes)
(package! doom-modeline-now-playing)
(package! doom-modeline)

(package! ox-reveal)
(package! impatient-mode)
(package! celestial-mode-line)

(package! sqlformat)

(package! emacsql-mysql)
(package! ob-sql-mode)
(package! sqlformat)
(package! esqlite)
(package! sql-indent)
(package! sqlup-mode)
(package! emacsql-psql)
(package! emacsql-mysql)
(package! emacsql-sqlite-module)
(package! emacsql-sqlite-builtin)

(package! centered-cursor-mode)

(package! org-pomodoro)

(package! pyim)
(package! pyim-basedict)

;; (package! datomic-snippets)

(package! flymd)

(package! nov)

(package! emojify)

(package! pyim-basedict)
(package! pyim)
(package! bing-dict)
(package! zh-align
  :recipe (:host github
           :repo "chen-chao/zh-align.el"))
(package! doom-themes)
(package! evil-collection)
(package! bing-dict)
(package! straight :pin "3eca39d")

(package! ox-reveal)
(package! impatient-mode)
;; (package! httpd)

(package! eslint-rc)
(package! setup)
;; (use-package! flymake-eslint
;;   :config
;;   (add-hook web-mode-hook flymake-eslint-enable))

(package! indium)

(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))

(package! org-bullets)
(package! org-superstar)

(package! org-present)
