(package! elfeed)
(package! webfeeder)

(package! conda)

(package! ein)

(package! ewal-doom-themes)
(package! doom-themes)
(package! doom-modeline-now-playing)
(package! doom-modeline)

(package! ox-reveal)
(package! impatient-mode)
(package! celestial-mode-line)

(package! sqlformat)

(package! emacsql-mysql)
(package! ob-sql-mode)
(package! sqlformat)
(package! esqlite)
(package! sql-indent)
(package! sqlup-mode)
(package! emacsql-psql)
(package! emacsql-mysql)
(package! emacsql-sqlite-module)
(package! emacsql-sqlite-builtin)

(package! centered-cursor-mode)

(package! org-pomodoro)

(package! pyim)
(package! pyim-basedict)

;; (package! datomic-snippets)

(package! flymd)

(package! nov)
  ;; :recipe (:host github
  ;;          :repo "emacs-pe/nov.el"))

(package! emojify)

(package! pyim-basedict)
(package! pyim)
(package! bing-dict)
(package! zh-align
  :recipe (:host github
           :repo "chen-chao/zh-align.el"))
(package! doom-themes)
(package! evil-collection)
(package! bing-dict)
(package! straight :pin "3eca39d")

(package! ox-reveal)
(package! impatient-mode)
;; (package! httpd)

(package! eslint-rc)
(package! setup)
;; (use-package! flymake-eslint
;;   :config
;;   (add-hook web-mode-hook flymake-eslint-enable))

(package! indium)

;; (package! sly :disable t)
;; (package! sly-macrostep :disable t)
;; (package! sly-repl-ansi-color :disable t)
;; (package! slime)
;; (package! slime-js
;;         :recipe (:host github
;;                  :repo "swank-js/swank-js"))

;; (package! copilot
;;   :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))

  ;; :pin "0160a1108b3bc3fff7e9fe1ebb67e71c0c2a334d")

(package! org-bullets)
(package! org-superstar)

(package! org-present)

(package! clojure-mode-extra-font-locking)

(package! neotree)

(package! khoj)

(package! tblui)
;; (package! chatgpt
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/chatgpt.el"))

;; (package! chatgpt-shell
;;   :recipe
;;   (:host github
;;    :repo "xenodium/chatgpt-shell"))

;; (package! dall-e
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/dall-e"
;;    :files ("*.el")))

;; (package! chatgpt
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/chatgpt"
;;    :files ("*.el")))

;; (package! treemacs :pin "7c6628a241845cd8f626d2603f747f777de4eefb")

(package! calfw)
(package! calfw-org)
(package! calfw-ical)

(package! highlight-indentation)

(package! exwm)

  ;; (package! edwina)
  ;; (package! evil-multiedit)
  ;; (package! all-the-icons-completion)
  ;; (package! all-the-icons-ivy)
  ;; (package! all-the-icons-ibuffer)
  ;; (package! dashboard)
  ;; (package! quelpa-use-package)
  ;; (package! eaf)
  ;; (package! epc)
  ;; (package! ctable)
  ;; (package! deferred)
  ;; (package! s)
  ;; (package! elmacro)
  ;; ;; (package! chembalance)
  ;; (package! chemtable)
  ;; (package! calfw-org)
  ;; (package! calfw-cal)
  ;; (package! calfw-ical)
  ;; (package! calfw-gcal)
  ;; (package! ox-reveal)
  ;; (package! htmlize)
  ;; (package! celestial-mode-line)
  ;; (package! sunshine)
  ;; (package! evil-nerd-commenter)

(package! cape)

(package! codeium :recipe (:host github :repo "Exafunction/codeium.el"))
;; (package! cape)

(package! corfu)

(package! http)

(package! google-translate)
(package! google)
(package! posframe)
(package! go-translate)

(package! germanium)

(package! yaml-mode)

(package! eglot-signature-eldoc-talkative)

(package! protobuf-mode)
